app/controllers/sessions_controller.rb

  def create
    user = User.find_by(login: params[:login].downcase)
---
SELECT  "users".* FROM "users" WHERE "users"."login" = $1 LIMIT 1  [["login", ""]]