app/controllers/users_controller.rb

INSERT INTO "users" ("login", "first_name", "second_name", "email", "password_digest", "avatar_file_name", "avatar_content_type", "avatar_file_size", "avatar_updated_at", "created_at", "updated_at", "remember_token") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save